system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interKistlerFoam;

startFrom       latestTime;//If we restart simulation continues from the last time step

startTime       0;

stopAt          endTime;

endTime         0.02;//we stop after 500 TU - adjustableRunTime!

deltaT          1e-08;//initial time step size

writeControl    adjustableRunTime;//simulation can automatically adjust the tim$

writeInterval   1e-4;//we write out every 5 TU

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;//adjustableRunTime can modifiy the time step size

adjustTimeStep  yes;//adjustableRunTime can modifiy the time step size

//JN: Co = U*dt/dx
//U is defined by the flow
//dx is defined by the cell size i.e. the mesh
//Co should be below or equal to 1
//dt is the only value, which can guarantee this
//dt is changed in each time step

maxCo           0.95;//maximum value for Courant number // changed from 0.95 to 0.4 as a test 23/09/25
maxAlphaCo      0.95;//maximum value for Courant number of the interface water/air // changed from 0.95 to 0.4 as a test 23/09/25

maxDeltaT       1;//maximum time step /changed to 0.5 23/09/25

libs
(
    "$FOAM_USER_LIBBIN/libDynamicKistlerContactAngle.so"
);

// ************************************************************************* //
